### Load in Pandas

In [2]:
import pandas as pd

### Series Data Structure

In [3]:
m = [2,4,6,8]

ser = pd.Series(m)
print(ser)

print(type(ser))

0    2
1    4
2    6
3    8
dtype: int64
<class 'pandas.core.series.Series'>

#### Custom Index

In [4]:
m = [2,4,6,8]

ser = pd.Series(m, index=['a','b','c','d'], dtype="float")
print(ser)

a    2.0
b    4.0
c    6.0
d    8.0
dtype: float64

In [5]:
dic_data = {"language":["Python", "R", "Swift"], "ranking":[1,2,3], "no_of_initials":[6,1,5]}

ser = pd.Series(dic_data)
print(ser)

language          [Python, R, Swift]
ranking                    [1, 2, 3]
no_of_initials             [6, 1, 5]
dtype: object

#### Create a Series

In [6]:
ser = pd.Series([10,11,12,13,14], index=[1,2,3,4,5])

print(ser)
print(type(ser))

1    10
2    11
3    12
4    13
5    14
dtype: int64
<class 'pandas.core.series.Series'>

#### Add two series

In [7]:
ser1 = pd.Series(13, index=[0,1,2,3,4,5,6,7,8])
ser2 = pd.Series(3, index=[0,1,2,3,4])

ser3 = ser1+ser2
print(ser3)   # NaN - Not a Number

0    16.0
1    16.0
2    16.0
3    16.0
4    16.0
5     NaN
6     NaN
7     NaN
8     NaN
dtype: float64

### DataFrame

In [8]:
m = [1,3,5,7,9]

df = pd.DataFrame(m)
print(df)

print(type(df))

   0
0  1
1  3
2  5
3  7
4  9
<class 'pandas.core.frame.DataFrame'>

In [9]:
m = {"a":[1,2,3,4], "b":[5,6,7,8],"c":[9,10,11,12]}

df = pd.DataFrame(m)
print(df)

print()

print(type(df))

print()

print(df["b"][1]) # Get values

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

<class 'pandas.core.frame.DataFrame'>

6

### Arithmetic Operations

In [10]:
m = {"a":[1,2,3], "b":[4,5,6], "c":[7,8,9]}

df1 = pd.DataFrame(m)
print(df1)

print()

df1["total"] = df1["a"] + df1["b"] + df1["c"]
print(df1)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

   a  b  c  total
0  1  4  7     12
1  2  5  8     15
2  3  6  9     18

### Other arithmetic operations

In [11]:
df1 = pd.DataFrame({"a":[1,2,3], "b":[4,5,6], "c":[7,8,9]})
print(df1)

print()

# Multiplication 
print("Multiplication : ")
df1["total"] = df1["a"] * df1["b"] * df1["c"]
print(df1) 

print()

# Subtraction 
print("Subtraction : ")
df2 = df1["total"] = df1["a"] - df1["b"] - df1["c"]
print(df2) 

print()

# Division 
print("Division : ")
df3 = df1["total"] = df1["a"] / df1["b"] / df1["c"]
print(df3)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

Multiplication :
   a  b  c  total
0  1  4  7     28
1  2  5  8     80
2  3  6  9    162

Subtraction :
0   -10
1   -11
2   -12
dtype: int64

Division :
0    0.035714
1    0.050000
2    0.055556
dtype: float64

### Insert Data

In [12]:
var = pd.DataFrame({"A":[1,2,3], "B":[4,5,6]})
print(var)

print() 

var.insert(2, "New", [13,14,15])
var

   A  B
0  1  4
1  2  5
2  3  6

   A  B  New
0  1  4   13
1  2  5   14
2  3  6   15

### Delete Data

In [13]:
var = pd.DataFrame({"A":[1,2,3], "B":[4,5,6], "New":[13,14,15]})
print(var)

print()

var.pop("B")
var

   A  B  New
0  1  4   13
1  2  5   14
2  3  6   15

   A  New
0  1   13
1  2   14
2  3   15

### Create a CSV File !

In [14]:
disc = {"Roll.No.":[101,102,103,104,105,106,107,108,109,110], "Name":['Mardav', 'Atharva', 'Divyansh', 'Pari', 'Aanvi', 'Joy', 'Avyan', 'Khushi', 'Mayank', 'Binod'], "Score":[13,9,51,5,78,12,52,1,2,0]}

data = pd.DataFrame(disc)
print(data) 

# Creating its csv file 
data.to_csv("StudentInfo.csv", index=False)

   Roll.No.      Name  Score
0       101    Mardav     13
1       102   Atharva      9
2       103  Divyansh     51
3       104      Pari      5
4       105     Aanvi     78
5       106       Joy     12
6       107     Avyan     52
7       108    Khushi      1
8       109    Mayank      2
9       110     Binod      0

### Read a CSV File !

In [15]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv")

read_data

   Roll.No.      Name  Score
0       101    Mardav     13
1       102   Atharva      9
2       103  Divyansh     51
3       104      Pari      5
4       105     Aanvi     78
5       106       Joy     12
6       107     Avyan     52
7       108    Khushi      1
8       109    Mayank      2
9       110     Binod      0

#### Get rows

In [16]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv", nrows=4)

read_data

   Roll.No.      Name  Score
0       101    Mardav     13
1       102   Atharva      9
2       103  Divyansh     51
3       104      Pari      5

#### Get columns

In [17]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv", usecols=["Name"])

read_data

       Name
0    Mardav
1   Atharva
2  Divyansh
3      Pari
4     Aanvi
5       Joy
6     Avyan
7    Khushi
8    Mayank
9     Binod

#### Skip the rows

In [18]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv", skiprows=[3,5,7])

read_data

   Roll.No.     Name  Score
0       101   Mardav     13
1       102  Atharva      9
2       104     Pari      5
3       106      Joy     12
4       108   Khushi      1
5       109   Mayank      2
6       110    Binod      0

#### Replace the header

In [19]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv", header = 1)

read_data

   101    Mardav  13
0  102   Atharva   9
1  103  Divyansh  51
2  104      Pari   5
3  105     Aanvi  78
4  106       Joy  12
5  107     Avyan  52
6  108    Khushi   1
7  109    Mayank   2
8  110     Binod   0

#### Convert int values to float

In [20]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv", dtype={"Score":"float"})

read_data

   Roll.No.      Name  Score
0       101    Mardav   13.0
1       102   Atharva    9.0
2       103  Divyansh   51.0
3       104      Pari    5.0
4       105     Aanvi   78.0
5       106       Joy   12.0
6       107     Avyan   52.0
7       108    Khushi    1.0
8       109    Mayank    2.0
9       110     Binod    0.0

#### Custom Header

In [21]:
read_data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv", header = None, names=["Room No.","Brand","Runs"])

read_data

    Room No.     Brand   Runs
0   Roll.No.      Name  Score
1        101    Mardav     13
2        102   Atharva      9
3        103  Divyansh     51
4        104      Pari      5
5        105     Aanvi     78
6        106       Joy     12
7        107     Avyan     52
8        108    Khushi      1
9        109    Mayank      2
10       110     Binod      0

### CSV File Functions

In [22]:
data = pd.read_csv(r"C:\Users\MARDAV JADAUN\OneDrive\Desktop\Python\Pandas-in-Python\StudentInfo.csv")

data.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
data.columns

Index(['Roll.No.', 'Name', 'Score'], dtype='object')

In [24]:
data.describe()

        Roll.No.      Score
count   10.00000  10.000000
mean   105.50000  22.300000
std      3.02765  27.568299
min    101.00000   0.000000
25%    103.25000   2.750000
50%    105.50000  10.500000
75%    107.75000  41.500000
max    110.00000  78.000000

#### Head Function

In [25]:
data.head()

   Roll.No.      Name  Score
0       101    Mardav     13
1       102   Atharva      9
2       103  Divyansh     51
3       104      Pari      5
4       105     Aanvi     78

#### Tail Function

In [26]:
data.tail()

   Roll.No.    Name  Score
5       106     Joy     12
6       107   Avyan     52
7       108  Khushi      1
8       109  Mayank      2
9       110   Binod      0

#### Get fixed data

In [27]:
data[4:7]

   Roll.No.   Name  Score
4       105  Aanvi     78
5       106    Joy     12
6       107  Avyan     52

### Covert index to array

In [28]:
data.index.array

<NumpyExtensionArray>
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Length: 10, dtype: int64

### Convert to Numpy Array

In [29]:
# first method
data.to_numpy()

array([[101, 'Mardav', 13],
       [102, 'Atharva', 9],
       [103, 'Divyansh', 51],
       [104, 'Pari', 5],
       [105, 'Aanvi', 78],
       [106, 'Joy', 12],
       [107, 'Avyan', 52],
       [108, 'Khushi', 1],
       [109, 'Mayank', 2],
       [110, 'Binod', 0]], dtype=object)

In [30]:
# second method 
import numpy as np 
m = np.asarray(data)
m

array([[101, 'Mardav', 13],
       [102, 'Atharva', 9],
       [103, 'Divyansh', 51],
       [104, 'Pari', 5],
       [105, 'Aanvi', 78],
       [106, 'Joy', 12],
       [107, 'Avyan', 52],
       [108, 'Khushi', 1],
       [109, 'Mayank', 2],
       [110, 'Binod', 0]], dtype=object)